In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_csv("netflix1.csv")

In [3]:
df.head()

,show_id,type,title,director,country,date_added,release_year,rating,duration,listed_in
0,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,United States,9/25/2021,2020,PG-13,90 min,Documentaries
1,s3,TV Show,Ganglands,Julien Leclercq,France,9/24/2021,2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act..."
2,s6,TV Show,Midnight Mass,Mike Flanagan,United States,9/24/2021,2021,TV-MA,1 Season,"TV Dramas, TV Horror, TV Mysteries"
3,s14,Movie,Confessions of an Invisible Girl,Bruno Garotti,Brazil,9/22/2021,2021,TV-PG,91 min,"Children & Family Movies, Comedies"
4,s8,Movie,Sankofa,Haile Gerima,United States,9/24/2021,1993,TV-MA,125 min,"Dramas, Independent Movies, International Movies"

In [4]:
df.tail()

,show_id,type,title,director,country,date_added,release_year,rating,duration,listed_in
8785,s8797,TV Show,Yunus Emre,Not Given,Turkey,1/17/2017,2016,TV-PG,2 Seasons,"International TV Shows, TV Dramas"
8786,s8798,TV Show,Zak Storm,Not Given,United States,9/13/2018,2016,TV-Y7,3 Seasons,Kids' TV
8787,s8801,TV Show,Zindagi Gulzar Hai,Not Given,Pakistan,12/15/2016,2012,TV-PG,1 Season,"International TV Shows, Romantic TV Shows, TV ..."
8788,s8784,TV Show,Yoko,Not Given,Pakistan,6/23/2018,2016,TV-Y,1 Season,Kids' TV
8789,s8786,TV Show,YOM,Not Given,Pakistan,6/7/2018,2016,TV-Y7,1 Season,Kids' TV

In [5]:
df.isnull().sum()

show_id         0
type            0
title           0
director        0
country         0
date_added      0
release_year    0
rating          0
duration        0
listed_in       0
dtype: int64

In [6]:
df.describe()

       release_year
count   8790.000000
mean    2014.183163
std        8.825466
min     1925.000000
25%     2013.000000
50%     2017.000000
75%     2019.000000
max     2021.000000

In [7]:
df.shape

(8790, 10)

In [8]:
df.columns

Index(['show_id', 'type', 'title', 'director', 'country', 'date_added',
       'release_year', 'rating', 'duration', 'listed_in'],
      dtype='object')

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8790 entries, 0 to 8789
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       8790 non-null   object
 1   type          8790 non-null   object
 2   title         8790 non-null   object
 3   director      8790 non-null   object
 4   country       8790 non-null   object
 5   date_added    8790 non-null   object
 6   release_year  8790 non-null   int64
 7   rating        8790 non-null   object
 8   duration      8790 non-null   object
 9   listed_in     8790 non-null   object
dtypes: int64(1), object(9)
memory usage: 686.8+ KB

In [13]:
df["date_added"] = pd.to_datetime(df["date_added"])
df["date_added"].dtypes

dtype('<M8[ns]')

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8790 entries, 0 to 8789
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       8790 non-null   object
 1   type          8790 non-null   object
 2   title         8790 non-null   object
 3   director      8790 non-null   object
 4   country       8790 non-null   object
 5   date_added    8790 non-null   datetime64[ns]
 6   release_year  8790 non-null   int64
 7   rating        8790 non-null   object
 8   duration      8790 non-null   object
 9   listed_in     8790 non-null   object
dtypes: datetime64[ns](1), int64(1), object(8)
memory usage: 686.8+ KB

In [17]:
df.describe(include="all")

,show_id,type,title,director,country,date_added,release_year,rating,duration,listed_in
count,8790,8790,8790,8790,8790,8790,8790.000000,8790,8790,8790
unique,8790,2,8787,4528,86,NaN,NaN,14,220,513
top,s8786,Movie,9-Feb,Not Given,United States,NaN,NaN,TV-MA,1 Season,"Dramas, International Movies"
freq,1,6126,2,2588,3240,NaN,NaN,3205,1791,362
mean,NaN,NaN,NaN,NaN,NaN,2019-05-17 21:44:01.638225408,2014.183163,NaN,NaN,NaN
min,NaN,NaN,NaN,NaN,NaN,2008-01-01 00:00:00,1925.000000,NaN,NaN,NaN
25%,NaN,NaN,NaN,NaN,NaN,2018-04-06 00:00:00,2013.000000,NaN,NaN,NaN
50%,NaN,NaN,NaN,NaN,NaN,2019-07-03 00:00:00,2017.000000,NaN,NaN,NaN
75%,NaN,NaN,NaN,NaN,NaN,2020-08-19 18:00:00,2019.000000,NaN,NaN,NaN
max,NaN,NaN,NaN,NaN,NaN,2021-09-25 00:00:00,2021.000000,NaN,NaN,NaN
std,NaN,NaN,NaN,NaN,NaN,NaN,8.825466,NaN,NaN,NaN

In [19]:
df.head()

,show_id,type,title,director,country,date_added,release_year,rating,duration,listed_in
0,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,United States,2021-09-25,2020,PG-13,90 min,Documentaries
1,s3,TV Show,Ganglands,Julien Leclercq,France,2021-09-24,2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act..."
2,s6,TV Show,Midnight Mass,Mike Flanagan,United States,2021-09-24,2021,TV-MA,1 Season,"TV Dramas, TV Horror, TV Mysteries"
3,s14,Movie,Confessions of an Invisible Girl,Bruno Garotti,Brazil,2021-09-22,2021,TV-PG,91 min,"Children & Family Movies, Comedies"
4,s8,Movie,Sankofa,Haile Gerima,United States,2021-09-24,1993,TV-MA,125 min,"Dramas, Independent Movies, International Movies"

In [26]:
types = df["type"].value_counts().reset_index()
types

      type  count
0    Movie   6126
1  TV Show   2664

In [24]:
countries = df["country"].value_counts().reset_index()
countries

           country  count
0    United States   3240
1            India   1057
2   United Kingdom    638
3         Pakistan    421
4        Not Given    287
..             ...    ...
81      Luxembourg      1
82         Senegal      1
83         Belarus      1
84     Puerto Rico      1
85          Cyprus      1

[86 rows x 2 columns]

In [31]:
df.groupby("type")["country"].value_counts().reset_index()

        type               country  count
0      Movie         United States   2395
1      Movie                 India    976
2      Movie        United Kingdom    387
3      Movie             Not Given    257
4      Movie                Canada    187
..       ...                   ...    ...
133  TV Show           Puerto Rico      1
134  TV Show               Senegal      1
135  TV Show           Switzerland      1
136  TV Show  United Arab Emirates      1
137  TV Show               Uruguay      1

[138 rows x 3 columns]

In [36]:
df.groupby("type")["director"].value_counts().reset_index()

         type                              director  count
0       Movie                             Not Given    173
1       Movie                         Rajiv Chilaka     19
2       Movie                Raúl Campos, Jan Suter     18
3       Movie                           Suhas Kadav     16
4       Movie                          Marcus Raboy     15
...       ...                                   ...    ...
4576  TV Show                   Vijay S. Bhanushali      1
4577  TV Show  Vikramaditya Motwane, Anurag Kashyap      1
4578  TV Show                        Wouter Bouvijn      1
4579  TV Show                         Yasuhiro Irie      1
4580  TV Show                          Ziad Doueiri      1

[4581 rows x 3 columns]

In [46]:
director = df[df["director"] != "Not Given"][["type", "director"]].value_counts().sort_values(ascending=False).reset_index()
director

         type                              director  count
0       Movie                         Rajiv Chilaka     19
1       Movie                Raúl Campos, Jan Suter     18
2       Movie                           Suhas Kadav     16
3       Movie                          Marcus Raboy     15
4     TV Show                   Alastair Fothergill     14
...       ...                                   ...    ...
4574  TV Show                   Vijay S. Bhanushali      1
4575  TV Show  Vikramaditya Motwane, Anurag Kashyap      1
4576  TV Show                        Wouter Bouvijn      1
4577  TV Show                         Yasuhiro Irie      1
4578    Movie                         Thomas Stuber      1

[4579 rows x 3 columns]

In [56]:
top_10_director = director.head(10)
top_10_director

      type                director  count
0    Movie           Rajiv Chilaka     19
1    Movie  Raúl Campos, Jan Suter     18
2    Movie             Suhas Kadav     16
3    Movie            Marcus Raboy     15
4  TV Show     Alastair Fothergill     14
5    Movie               Jay Karas     14
6    Movie     Cathy Garcia-Molina     13
7    Movie         Martin Scorsese     12
8    Movie             Jay Chapman     12
9    Movie         Youssef Chahine     12

In [66]:
top_10_movie_director = director[director["type"] == "Movie"].head(10)
top_10_movie_director

     type                director  count
0   Movie           Rajiv Chilaka     19
1   Movie  Raúl Campos, Jan Suter     18
2   Movie             Suhas Kadav     16
3   Movie            Marcus Raboy     15
5   Movie               Jay Karas     14
6   Movie     Cathy Garcia-Molina     13
7   Movie         Martin Scorsese     12
8   Movie             Jay Chapman     12
9   Movie         Youssef Chahine     12
10  Movie        Steven Spielberg     11

In [67]:
top_10_TVShow_director = director[director["type"] == "TV Show"].head(10)
top_10_TVShow_director

         type                           director  count
4     TV Show                Alastair Fothergill     14
82    TV Show       Mark Thornton, Todd Kauffman      5
234   TV Show                        Stan Lathan      3
835   TV Show                        Hsu Fu-chun      2
836   TV Show                     Iginio Straffi      2
837   TV Show                          Ken Burns      2
839   TV Show                    Rob Seidenglanz      2
840   TV Show                        Shin Won-ho      2
871   TV Show                          Sion Sono      1
2292  TV Show  Thierry Demaizière, Alban Teurlai      1

In [72]:
df["country"].unique()

array(['United States', 'France', 'Brazil', 'United Kingdom', 'India',
       'Germany', 'Pakistan', 'Not Given', 'China', 'South Africa',
       'Japan', 'Nigeria', 'Spain', 'Philippines', 'Australia',
       'Argentina', 'Canada', 'Hong Kong', 'Italy', 'New Zealand',
       'Egypt', 'Colombia', 'Mexico', 'Belgium', 'Switzerland', 'Taiwan',
       'Bulgaria', 'Poland', 'South Korea', 'Saudi Arabia', 'Thailand',
       'Indonesia', 'Kuwait', 'Malaysia', 'Vietnam', 'Lebanon', 'Romania',
       'Syria', 'United Arab Emirates', 'Sweden', 'Mauritius', 'Austria',
       'Turkey', 'Czech Republic', 'Cameroon', 'Netherlands', 'Ireland',
       'Russia', 'Kenya', 'Chile', 'Uruguay', 'Bangladesh', 'Portugal',
       'Hungary', 'Norway', 'Singapore', 'Iceland', 'Serbia', 'Namibia',
       'Peru', 'Mozambique', 'Ghana', 'Zimbabwe', 'Israel', 'Finland',
       'Denmark', 'Paraguay', 'Cambodia', 'Georgia', 'Soviet Union',
       'Greece', 'West Germany', 'Iran', 'Venezuela', 'Slovenia',
       'Guatemala', 'Jamaica', 'Somalia', 'Croatia', 'Jordan',
       'Luxembourg', 'Senegal', 'Belarus', 'Puerto Rico', 'Cyprus',
       'Ukraine'], dtype=object)

In [73]:
df["country"].nunique()

86

In [75]:
df["director"].nunique()

4528

In [76]:
df["director"].unique()

array(['Kirsten Johnson', 'Julien Leclercq', 'Mike Flanagan', ...,
       'Majid Al Ansari', 'Peter Hewitt', 'Mozez Singh'],
      shape=(4528,), dtype=object)